using UnityEngine;
using UnityEngine.UI;

public class MessageController : MonoBehaviour
{
    public Text terminal;

    private string[] firstPart =
{
        "Капитан Фиджитон: ", "Капитан Рофлтан: ", "Капитан Фон Аваркен: ", "Капитан Эль Дюпуа: ", "Капитан Роджерс: ", "Капитан Вахтангова: ",
        "Капитан Бекон: ", "Уборщик Клинер: ", "Гениальный ученый Илом Наск: ", "Простой сантехник Гусейн: ",
        "Весельчак Курт: ", "Воробей, капитан Воробей: ", "Прачка Сурен: ",  "Электрик 1-ого разряда: ", "Злой ученый Франкентролль: ", "Парень который просто любил эту жизнь: ",
        "Капитан Бекон: ", "Потерявшийся во времени школьник: ", "Бедный студен: ", "Мажор без денег: ",
        "Банка советской тушенки: ", "ООО Мастер Ведьмак: ", "Добрый гуль: "
    };
    private string[] middlePart =
    {
        "Я всегда мечтал увидеть темную материю и  завидовал младшей сестре.", "Я никогда не умел открывать двери, но зато как то раз, я сорвал выборы 3543-го.", "Однажды я спас последнего живого человека, и организовал партию радикальных путешественников во времени.","Меня чуть не посадили за нарушение законов логики, но я стал героем, который решил проблему перенаселения Z3мли-12."
            ,"Я в бегах из за доказательства отсутствия B0гA, и мне пришлось жить под обитаемой вселенной 120 лет.", "Я работал над выращиванием искусственных детей для бесплодных, и случайно вывел расу нео саранчи.", "Как то раз я напугал деда, и умер от сердечного приступа.", "Несколько лет назад я работал в глубоком космосе, и порвал кротовую нору на две.", "Никогда не делал прививок, но очень любил животных и свою жену.", "У меня был полный багажник подарков, а пару дней назад даже украл кусок солнца.",
            "Я как то устроил аварию с черной дырой, заодно запретил горизонт событий.", "У меня был план покончить со временем, но увы, относительно доказал теорию неотносительности.", "Было дело, я держал разумного гуся в качестве секс раба.", "В 3542-ом я изнасиловал 14 других расс, жаль, что для золотой медали надо было 15.", "Сегодня съел последнего живого человека, чуть не подавился.",
            "Я боялся черных дыр, чуть меньше чем замкнутых пространств времени.", "Как то раз на пике балмера, я вывел расу нео саранчи.","Я всего лишь хотел попасть домой к ужину, но потерял семью в войне против нео саранчи.", "Ни разу не пожалел, что снимался в телешоу поцелуй незнакомца и про бодипозитив.", "Раньше я предсказывал судьбы людей, и однажды обвинил жертву.", "Я очень пытался откосить от службы, но Илом Наск нанял меня пилотом для странного запуска автомобиля в космос…", "Хехехе, я пытался призвать к революции на солнце, но вместо этого открыл расу гусей-планетарных потрошителей.", "Я настолько сумасшедший, что поймал вора за щупальце, который стер информацию о Z3мле-0."
    };

    void Start()
    {
    }

    void Update()
    {
        
    }

    public void SendMessage(bool isBig)
    { 
        terminal.text += "\r\n";
        if(isBig == false)
            terminal.text += "    " + firstPart[Random.Range(0, firstPart.Length)] + middlePart[Random.Range(0, middlePart.Length)];
    }
}
